In [88]:
import pandas as pd
pd.options.display.float_format = '{:,.2f}'.format
pd.set_option('display.width', 75)
pd.set_option('display.max_columns', 5)

tag = pd.read_csv('tag.csv',
    names=['userId','movieId','tag','timestamp'],
    skiprows=1,
    parse_dates=['timestamp'], infer_datetime_format=True)
tag['Date'] = tag.timestamp.dt.date
tag['Time'] = tag.timestamp.dt.time

rating = pd.read_csv('rating.csv',
    names=['userId','movieId','rating','timestamp'],
    skiprows=1,
    parse_dates=['timestamp'], infer_datetime_format=True)
rating['Date'] = tag.timestamp.dt.date
rating['Time'] = tag.timestamp.dt.time

movie = pd.read_csv('movie.csv',
    names=['movieId','title','genre'],
    skiprows=1)

gen_tag = pd.read_csv('genome_tags.csv',
    names=['tagId','tag'],
    skiprows=1)

In [89]:
tag.tag.nunique()

38643

In [90]:
tag.head().T

,0,1,2,3,4
userId,18,65,65,65,65
movieId,4141,208,353,521,592
tag,Mark Waters,dark hero,dark hero,noir thriller,dark hero
timestamp,2009-04-24 18:19:40,2013-05-10 01:41:18,2013-05-10 01:41:19,2013-05-10 01:39:43,2013-05-10 01:41:18
Date,2009-04-24,2013-05-10,2013-05-10,2013-05-10,2013-05-10
Time,18:19:40,01:41:18,01:41:19,01:39:43,01:41:18

In [91]:
tag.shape

(465564, 6)

In [92]:
tag.isnull().sum()

userId        0
movieId       0
tag          16
timestamp     0
Date          0
Time          0
dtype: int64

In [93]:
tag.loc[tag.tag.isnull()]

        userId  movieId  ...        Date      Time
373276  116460      123  ...  2008-01-04  12:47:47
373277  116460      346  ...  2008-01-04  13:05:46
373281  116460     1184  ...  2008-01-04  13:11:01
373288  116460     1785  ...  2008-01-04  13:06:46
373289  116460     2194  ...  2008-01-04  12:44:37
373291  116460     2691  ...  2008-01-04  12:50:02
373299  116460     4103  ...  2008-01-04  13:05:20
373301  116460     4473  ...  2008-01-04  12:50:40
373303  116460     4616  ...  2008-01-04  13:14:01
373319  116460     7624  ...  2008-01-04  13:11:06
373325  116460     8898  ...  2008-01-04  12:45:57
373332  116460    32460  ...  2008-01-04  12:48:21
373334  116460    33826  ...  2008-01-04  12:45:03
373339  116460    36537  ...  2008-01-04  12:45:36
373340  116460    55805  ...  2008-01-04  12:49:01
454615  133634    33826  ...  2008-09-15  03:55:08

[16 rows x 6 columns]

In [94]:
tag = tag.dropna(subset=['tag'], inplace=True)

In [95]:
rating.head().T

,0,1,2,3,4
userId,1,1,1,1,1
movieId,2,29,32,47,50
rating,3.50,3.50,3.50,3.50,3.50
timestamp,2005-04-02 23:53:47,2005-04-02 23:31:16,2005-04-02 23:33:39,2005-04-02 23:32:07,2005-04-02 23:29:40
Date,2009-04-24,2013-05-10,2013-05-10,2013-05-10,2013-05-10
Time,18:19:40,01:41:18,01:41:19,01:39:43,01:41:18

In [96]:
rating.shape

(20000263, 6)

In [97]:
movie.head()

,movieId,title,genre
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [98]:
movie.shape

(27278, 3)

In [99]:
gen_tag.head()

   tagId           tag
0      1           007
1      2  007 (series)
2      3  18th century
3      4         1920s
4      5         1930s

In [100]:
gen_tag.shape

(1128, 2)

In [101]:
gen_tag.tag.nunique()

1128

AttributeError: 'NoneType' object has no attribute 'describe'